app/Http/Middleware/ViewShare.php

select * from `pages` where `main_menu` = 1 and `is_active` = 1
select * from `pages` where `footer_menu` = 1 and `is_active` = 1
---
    public function handle($request, Closure $next)
    {
        //Main Menu
        $mainMenu = Page::where('main_menu',1)->where('is_active',1)->get();
        View::share('mainMenu', $mainMenu);

        //Footer Menu
        $footerMenu = Page::where('footer_menu',1)->where('is_active',1)->get();