app/Http/Controllers/HomeController.php

select * from `categories`
---
    public function home()
    {
        $categories = Category::all();